test/mocks/GetOrders.xml

<?xml version="1.0" encoding="UTF-8"?>
<GetOrdersResponse xmlns="urn:ebay:apis:eBLBaseComponents">
  <Timestamp>2015-10-11T15:01:00.222Z</Timestamp>
  <Ack>Success</Ack>
  <Version>939</Version>
  <Build>E939_CORE_APIXO_17691495_R1</Build>
  <PaginationResult>
    <TotalNumberOfPages>1</TotalNumberOfPages>
    <TotalNumberOfEntries>2</TotalNumberOfEntries>
  </PaginationResult>
  <HasMoreOrders>false</HasMoreOrders>
  <OrderArray>
    <Order>
      <OrderID>222222222222-1616161616161</OrderID>
      <OrderStatus>Completed</OrderStatus>
      <AdjustmentAmount currencyID="USD">0.0</AdjustmentAmount>
      <AmountPaid currencyID="USD">6.0</AmountPaid>
      <AmountSaved currencyID="USD">0.0</AmountSaved>
      <CheckoutStatus>
        <eBayPaymentStatus>NoPaymentFailure</eBayPaymentStatus>
        <LastModifiedTime>2015-10-11T00:00:00.000Z</LastModifiedTime>
        <PaymentMethod>PayPal</PaymentMethod>
        <Status>Complete</Status>
        <IntegratedMerchantCreditCardEnabled>false</IntegratedMerchantCreditCardEnabled>
      </CheckoutStatus>
      <ShippingDetails>
        <SalesTax>
          <SalesTaxPercent>0.0</SalesTaxPercent>
          <SalesTaxState></SalesTaxState>
          <ShippingIncludedInTax>false</ShippingIncludedInTax>
          <SalesTaxAmount currencyID="USD">0.0</SalesTaxAmount>
        </SalesTax>
        <ShippingServiceOptions>
          <ShippingService>USPSPriority</ShippingService>
          <ShippingServicePriority>1</ShippingServicePriority>
          <ExpeditedService>false</ExpeditedService>
          <ShippingTimeMin>1</ShippingTimeMin>
          <ShippingTimeMax>4</ShippingTimeMax>
        </ShippingServiceOptions>
        <InternationalShippingServiceOption>
          <ShippingService>InternationalPriorityShipping</ShippingService>
          <ShippingServicePriority>1</ShippingServicePriority>
          <ShipToLocation>CA</ShipToLocation>
          <ShipToLocation>GB</ShipToLocation>
          <ShipToLocation>DK</ShipToLocation>
          <ShipToLocation>RO</ShipToLocation>
          <ShipToLocation>SK</ShipToLocation>
          <ShipToLocation>BG</ShipToLocation>
          <ShipToLocation>CZ</ShipToLocation>
          <ShipToLocation>FI</ShipToLocation>
          <ShipToLocation>HU</ShipToLocation>
          <ShipToLocation>LV</ShipToLocation>
          <ShipToLocation>LT</ShipToLocation>
          <ShipToLocation>MT</ShipToLocation>
          <ShipToLocation>EE</ShipToLocation>
          <ShipToLocation>AU</ShipToLocation>
          <ShipToLocation>GR</ShipToLocation>
          <ShipToLocation>PT</ShipToLocation>
          <ShipToLocation>CY</ShipToLocation>
          <ShipToLocation>SI</ShipToLocation>
          <ShipToLocation>JP</ShipToLocation>
          <ShipToLocation>CN</ShipToLocation>
          <ShipToLocation>SE</ShipToLocation>
          <ShipToLocation>KR</ShipToLocation>
          <ShipToLocation>ID</ShipToLocation>
          <ShipToLocation>TW</ShipToLocation>
          <ShipToLocation>TH</ShipToLocation>
          <ShipToLocation>BE</ShipToLocation>
          <ShipToLocation>FR</ShipToLocation>
          <ShipToLocation>HK</ShipToLocation>
          <ShipToLocation>IE</ShipToLocation>
          <ShipToLocation>NL</ShipToLocation>
          <ShipToLocation>PL</ShipToLocation>
          <ShipToLocation>ES</ShipToLocation>
          <ShipToLocation>IT</ShipToLocation>
          <ShipToLocation>DE</ShipToLocation>
          <ShipToLocation>AT</ShipToLocation>
          <ShipToLocation>RU</ShipToLocation>
          <ShipToLocation>IL</ShipToLocation>
          <ShipToLocation>MX</ShipToLocation>
          <ShipToLocation>NZ</ShipToLocation>
          <ShipToLocation>PH</ShipToLocation>
          <ShipToLocation>SG</ShipToLocation>
          <ShipToLocation>CH</ShipToLocation>
          <ShipToLocation>NO</ShipToLocation>
          <ShipToLocation>SA</ShipToLocation>
          <ShipToLocation>UA</ShipToLocation>
          <ShipToLocation>AE</ShipToLocation>
          <ShipToLocation>QA</ShipToLocation>
          <ShipToLocation>KW</ShipToLocation>
          <ShipToLocation>BH</ShipToLocation>
          <ShipToLocation>HR</ShipToLocation>
          <ShipToLocation>MY</ShipToLocation>
          <ShipToLocation>CL</ShipToLocation>
          <ShipToLocation>CO</ShipToLocation>
          <ShipToLocation>CR</ShipToLocation>
          <ShipToLocation>DO</ShipToLocation>
          <ShipToLocation>PA</ShipToLocation>
          <ShipToLocation>TT</ShipToLocation>
          <ShipToLocation>GT</ShipToLocation>
          <ShipToLocation>SV</ShipToLocation>
          <ShipToLocation>HN</ShipToLocation>
          <ShipToLocation>JM</ShipToLocation>
        </InternationalShippingServiceOption>
        <SellingManagerSalesRecordNumber>109</SellingManagerSalesRecordNumber>
        <GetItFast>false</GetItFast>
      </ShippingDetails>
      <CreatedTime>2015-10-11T00:00:00.000Z</CreatedTime>
      <PaymentMethods>PayPal</PaymentMethods>
      <SellerEmail>ebay-seller@mail.com</SellerEmail>
      <ShippingAddress>
        <Name>Mr. John Buyer</Name>
        <Street1>1000 Market St</Street1>
        <Street2>2nd Floor</Street2>
        <CityName>San Francisco</CityName>
        <StateOrProvince>CA</StateOrProvince>
        <Country>US</Country>
        <CountryName>United States</CountryName>
        <Phone>111 222 3333</Phone>
        <PostalCode>94111-1111</PostalCode>
        <AddressID>3535353535353</AddressID>
        <AddressOwner>eBay</AddressOwner>
        <ExternalAddressID></ExternalAddressID>
      </ShippingAddress>
      <ShippingServiceSelected>
        <ShippingService>USPSPriority</ShippingService>
        <ShippingServiceCost currencyID="USD">0.0</ShippingServiceCost>
      </ShippingServiceSelected>
      <Subtotal currencyID="USD">6.0</Subtotal>
      <Total currencyID="USD">6.0</Total>
      <TransactionArray>
        <Transaction>
          <Buyer>
            <Email>ebay-buyer@mail.com</Email>
            <UserFirstName>John</UserFirstName>
            <UserLastName>Buyer</UserLastName>
          </Buyer>
          <ShippingDetails>
            <CalculatedShippingRate>
              <OriginatingPostalCode>94117</OriginatingPostalCode>
              <PackageDepth measurementSystem="English" unit="inches">12</PackageDepth>
              <PackageLength measurementSystem="English" unit="inches">12</PackageLength>
              <PackageWidth measurementSystem="English" unit="inches">12</PackageWidth>
              <PackagingHandlingCosts currencyID="USD">0.0</PackagingHandlingCosts>
              <ShippingIrregular>false</ShippingIrregular>
              <ShippingPackage>PackageThickEnvelope</ShippingPackage>
              <WeightMajor measurementSystem="English" unit="lbs">3</WeightMajor>
              <WeightMinor measurementSystem="English" unit="oz">0</WeightMinor>
            </CalculatedShippingRate>
            <SellingManagerSalesRecordNumber>109</SellingManagerSalesRecordNumber>
          </ShippingDetails>
          <CreatedDate>2015-10-11T00:00:00.000Z</CreatedDate>
          <Item>
            <ItemID>222222222222</ItemID>
            <Site>US</Site>
            <Title>Mason Jars</Title>
            <ConditionID>3000</ConditionID>
            <ConditionDisplayName>Used</ConditionDisplayName>
          </Item>
          <QuantityPurchased>2</QuantityPurchased>
          <Status>
            <PaymentHoldStatus>PaymentHold</PaymentHoldStatus>
            <InquiryStatus>NotApplicable</InquiryStatus>
            <ReturnStatus>NotApplicable</ReturnStatus>
          </Status>
          <TransactionID>1616161616161</TransactionID>
          <TransactionPrice currencyID="USD">3.0</TransactionPrice>
          <ShippingServiceSelected>
            <ShippingPackageInfo>
              <EstimatedDeliveryTimeMin>2015-10-19T07:00:00.000Z</EstimatedDeliveryTimeMin>
              <EstimatedDeliveryTimeMax>2015-10-19T07:00:00.000Z</EstimatedDeliveryTimeMax>
            </ShippingPackageInfo>
          </ShippingServiceSelected>
          <TransactionSiteID>US</TransactionSiteID>
          <Platform>eBay</Platform>
          <Taxes>
            <TotalTaxAmount currencyID="USD">0.0</TotalTaxAmount>
            <TaxDetails>
              <Imposition>SalesTax</Imposition>
              <TaxDescription>SalesTax</TaxDescription>
              <TaxAmount currencyID="USD">0.0</TaxAmount>
              <TaxOnSubtotalAmount currencyID="USD">0.0</TaxOnSubtotalAmount>
              <TaxOnShippingAmount currencyID="USD">0.0</TaxOnShippingAmount>
              <TaxOnHandlingAmount currencyID="USD">0.0</TaxOnHandlingAmount>
            </TaxDetails>
          </Taxes>
          <ActualShippingCost currencyID="USD">0.0</ActualShippingCost>
          <ActualHandlingCost currencyID="USD">0.0</ActualHandlingCost>
          <OrderLineItemID>222222222222-1616161616161</OrderLineItemID>
          <ExtendedOrderID>222222222222-1616161616161!545454545454</ExtendedOrderID>
          <eBayPlusTransaction>false</eBayPlusTransaction>
        </Transaction>
      </TransactionArray>
      <BuyerUserID>johnbuyer</BuyerUserID>
      <PaidTime>2015-10-11T00:00:00.000Z</PaidTime>
      <IntegratedMerchantCreditCardEnabled>false</IntegratedMerchantCreditCardEnabled>
      <EIASToken>nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn==</EIASToken>
      <PaymentHoldStatus>PaymentHold</PaymentHoldStatus>
      <PaymentHoldDetails>
        <ExpectedReleaseDate>2015-10-31T07:00:00.000Z</ExpectedReleaseDate>
        <RequiredSellerActionArray>
          <RequiredSellerAction>MarkAsShipped</RequiredSellerAction>
        </RequiredSellerActionArray>
        <NumOfReqSellerActions>1</NumOfReqSellerActions>
        <PaymentHoldReason>NewSeller</PaymentHoldReason>
      </PaymentHoldDetails>
      <IsMultiLegShipping>false</IsMultiLegShipping>
      <SellerUserID>joeseller</SellerUserID>
      <SellerEIASToken>mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm==</SellerEIASToken>
      <CancelStatus>NotApplicable</CancelStatus>
      <ExtendedOrderID>222222222222-1616161616161!545454545454</ExtendedOrderID>
      <ContainseBayPlusTransaction>false</ContainseBayPlusTransaction>
    </Order>
    <Order>
      <OrderID>333333333333-6666666666666</OrderID>
      <OrderStatus>Completed</OrderStatus>
      <AdjustmentAmount currencyID="USD">0.0</AdjustmentAmount>
      <AmountPaid currencyID="USD">12.0</AmountPaid>
      <AmountSaved currencyID="USD">0.0</AmountSaved>
      <CheckoutStatus>
        <eBayPaymentStatus>NoPaymentFailure</eBayPaymentStatus>
        <LastModifiedTime>2015-10-11T00:00:00.000Z</LastModifiedTime>
        <PaymentMethod>PayPal</PaymentMethod>
        <Status>Complete</Status>
        <IntegratedMerchantCreditCardEnabled>false</IntegratedMerchantCreditCardEnabled>
      </CheckoutStatus>
      <ShippingDetails>
        <SalesTax>
          <SalesTaxPercent>0.0</SalesTaxPercent>
          <SalesTaxState></SalesTaxState>
          <ShippingIncludedInTax>false</ShippingIncludedInTax>
          <SalesTaxAmount currencyID="USD">0.0</SalesTaxAmount>
        </SalesTax>
        <ShippingServiceOptions>
          <ShippingService>Other</ShippingService>
          <ShippingServiceCost currencyID="USD">2.0</ShippingServiceCost>
          <ShippingServicePriority>1</ShippingServicePriority>
          <ExpeditedService>false</ExpeditedService>
          <ShippingTimeMin>1</ShippingTimeMin>
          <ShippingTimeMax>10</ShippingTimeMax>
        </ShippingServiceOptions>
        <InternationalShippingServiceOption>
          <ShippingService>InternationalPriorityShipping</ShippingService>
          <ShippingServicePriority>1</ShippingServicePriority>
          <ShipToLocation>CA</ShipToLocation>
          <ShipToLocation>GB</ShipToLocation>
          <ShipToLocation>DK</ShipToLocation>
          <ShipToLocation>RO</ShipToLocation>
          <ShipToLocation>SK</ShipToLocation>
          <ShipToLocation>BG</ShipToLocation>
          <ShipToLocation>CZ</ShipToLocation>
          <ShipToLocation>FI</ShipToLocation>
          <ShipToLocation>HU</ShipToLocation>
          <ShipToLocation>LV</ShipToLocation>
          <ShipToLocation>LT</ShipToLocation>
          <ShipToLocation>MT</ShipToLocation>
          <ShipToLocation>EE</ShipToLocation>
          <ShipToLocation>AU</ShipToLocation>
          <ShipToLocation>GR</ShipToLocation>
          <ShipToLocation>PT</ShipToLocation>
          <ShipToLocation>CY</ShipToLocation>
          <ShipToLocation>SI</ShipToLocation>
          <ShipToLocation>JP</ShipToLocation>
          <ShipToLocation>SE</ShipToLocation>
          <ShipToLocation>KR</ShipToLocation>
          <ShipToLocation>ID</ShipToLocation>
          <ShipToLocation>TW</ShipToLocation>
          <ShipToLocation>ZA</ShipToLocation>
          <ShipToLocation>BE</ShipToLocation>
          <ShipToLocation>FR</ShipToLocation>
          <ShipToLocation>HK</ShipToLocation>
          <ShipToLocation>IE</ShipToLocation>
          <ShipToLocation>NL</ShipToLocation>
          <ShipToLocation>PL</ShipToLocation>
          <ShipToLocation>ES</ShipToLocation>
          <ShipToLocation>IT</ShipToLocation>
          <ShipToLocation>DE</ShipToLocation>
          <ShipToLocation>AT</ShipToLocation>
          <ShipToLocation>RU</ShipToLocation>
          <ShipToLocation>IL</ShipToLocation>
          <ShipToLocation>MX</ShipToLocation>
          <ShipToLocation>NZ</ShipToLocation>
          <ShipToLocation>PH</ShipToLocation>
          <ShipToLocation>SG</ShipToLocation>
          <ShipToLocation>NO</ShipToLocation>
          <ShipToLocation>SA</ShipToLocation>
          <ShipToLocation>UA</ShipToLocation>
          <ShipToLocation>AE</ShipToLocation>
          <ShipToLocation>QA</ShipToLocation>
          <ShipToLocation>KW</ShipToLocation>
          <ShipToLocation>BH</ShipToLocation>
          <ShipToLocation>HR</ShipToLocation>
          <ShipToLocation>MY</ShipToLocation>
          <ShipToLocation>CL</ShipToLocation>
          <ShipToLocation>CO</ShipToLocation>
          <ShipToLocation>CR</ShipToLocation>
          <ShipToLocation>DO</ShipToLocation>
          <ShipToLocation>PA</ShipToLocation>
          <ShipToLocation>TT</ShipToLocation>
          <ShipToLocation>GT</ShipToLocation>
          <ShipToLocation>SV</ShipToLocation>
          <ShipToLocation>HN</ShipToLocation>
          <ShipToLocation>JM</ShipToLocation>
        </InternationalShippingServiceOption>
        <SellingManagerSalesRecordNumber>107</SellingManagerSalesRecordNumber>
        <GetItFast>false</GetItFast>
      </ShippingDetails>
      <CreatedTime>2015-10-11T00:00:00.000Z</CreatedTime>
      <PaymentMethods>PayPal</PaymentMethods>
      <SellerEmail>ebay-seller@mail.com</SellerEmail>
      <ShippingAddress>
        <Name>John Buyer</Name>
        <Street1>1000 Market St</Street1>
        <Street2>2nd Floor</Street2>
        <CityName>San Francisco</CityName>
        <StateOrProvince>CA</StateOrProvince>
        <Country>US</Country>
        <CountryName>United States</CountryName>
        <Phone>111 222 3333</Phone>
        <PostalCode>94111-1111</PostalCode>
        <AddressID>3535353535353</AddressID>
        <AddressOwner>eBay</AddressOwner>
        <ExternalAddressID></ExternalAddressID>
      </ShippingAddress>
      <ShippingServiceSelected>
        <ShippingService>Other</ShippingService>
        <ShippingServiceCost currencyID="USD">2.0</ShippingServiceCost>
      </ShippingServiceSelected>
      <Subtotal currencyID="USD">10.0</Subtotal>
      <Total currencyID="USD">12.0</Total>
      <TransactionArray>
        <Transaction>
          <Buyer>
            <Email>ebay-buyer@mail.com</Email>
            <UserFirstName>John</UserFirstName>
            <UserLastName>Buyer</UserLastName>
          </Buyer>
          <ShippingDetails>
            <SellingManagerSalesRecordNumber>107</SellingManagerSalesRecordNumber>
          </ShippingDetails>
          <CreatedDate>2015-10-11T00:00:00.000Z</CreatedDate>
          <Item>
            <ItemID>333333333333</ItemID>
            <Site>US</Site>
            <Title>Penguin</Title>
          </Item>
          <QuantityPurchased>1</QuantityPurchased>
          <Status>
            <PaymentHoldStatus>PaymentHold</PaymentHoldStatus>
            <InquiryStatus>NotApplicable</InquiryStatus>
            <ReturnStatus>NotApplicable</ReturnStatus>
          </Status>
          <TransactionID>6666666666666</TransactionID>
          <TransactionPrice currencyID="USD">10.0</TransactionPrice>
          <ShippingServiceSelected>
            <ShippingPackageInfo>
              <EstimatedDeliveryTimeMin>2015-10-20T07:00:00.000Z</EstimatedDeliveryTimeMin>
              <EstimatedDeliveryTimeMax>2015-10-20T07:00:00.000Z</EstimatedDeliveryTimeMax>
            </ShippingPackageInfo>
          </ShippingServiceSelected>
          <TransactionSiteID>US</TransactionSiteID>
          <Platform>eBay</Platform>
          <Taxes>
            <TotalTaxAmount currencyID="USD">0.0</TotalTaxAmount>
            <TaxDetails>
              <Imposition>SalesTax</Imposition>
              <TaxDescription>SalesTax</TaxDescription>
              <TaxAmount currencyID="USD">0.0</TaxAmount>
              <TaxOnSubtotalAmount currencyID="USD">0.0</TaxOnSubtotalAmount>
              <TaxOnShippingAmount currencyID="USD">0.0</TaxOnShippingAmount>
              <TaxOnHandlingAmount currencyID="USD">0.0</TaxOnHandlingAmount>
            </TaxDetails>
            <TaxDetails>
              <Imposition>WasteRecyclingFee</Imposition>
              <TaxDescription>ElectronicWasteRecyclingFee</TaxDescription>
              <TaxAmount currencyID="USD">0.0</TaxAmount>
            </TaxDetails>
          </Taxes>
          <ActualShippingCost currencyID="USD">2.0</ActualShippingCost>
          <ActualHandlingCost currencyID="USD">0.0</ActualHandlingCost>
          <OrderLineItemID>333333333333-6666666666666</OrderLineItemID>
          <ExtendedOrderID>333333333333-6666666666666!545454545454</ExtendedOrderID>
          <eBayPlusTransaction>false</eBayPlusTransaction>
        </Transaction>
        <Transaction>
          <Buyer>
            <Email>ebay-buyer@mail.com</Email>
            <UserFirstName>Mary</UserFirstName>
            <UserLastName>Buyer</UserLastName>
          </Buyer>
          <ShippingDetails>
            <SellingManagerSalesRecordNumber>208</SellingManagerSalesRecordNumber>
          </ShippingDetails>
          <CreatedDate>2015-10-12T00:00:00.000Z</CreatedDate>
          <Item>
            <ItemID>444444444444</ItemID>
            <Site>US</Site>
            <Title>Panda</Title>
          </Item>
          <QuantityPurchased>1</QuantityPurchased>
          <Status>
            <PaymentHoldStatus>PaymentHold</PaymentHoldStatus>
            <InquiryStatus>NotApplicable</InquiryStatus>
            <ReturnStatus>NotApplicable</ReturnStatus>
          </Status>
          <TransactionID>7777777777777</TransactionID>
          <TransactionPrice currencyID="USD">20.0</TransactionPrice>
          <ShippingServiceSelected>
            <ShippingPackageInfo>
              <EstimatedDeliveryTimeMin>2015-10-21T07:00:00.000Z</EstimatedDeliveryTimeMin>
              <EstimatedDeliveryTimeMax>2015-10-21T07:00:00.000Z</EstimatedDeliveryTimeMax>
            </ShippingPackageInfo>
          </ShippingServiceSelected>
          <TransactionSiteID>US</TransactionSiteID>
          <Platform>eBay</Platform>
          <Taxes>
            <TotalTaxAmount currencyID="USD">0.0</TotalTaxAmount>
            <TaxDetails>
              <Imposition>SalesTax</Imposition>
              <TaxDescription>SalesTax</TaxDescription>
              <TaxAmount currencyID="USD">0.0</TaxAmount>
              <TaxOnSubtotalAmount currencyID="USD">0.0</TaxOnSubtotalAmount>
              <TaxOnShippingAmount currencyID="USD">0.0</TaxOnShippingAmount>
              <TaxOnHandlingAmount currencyID="USD">0.0</TaxOnHandlingAmount>
            </TaxDetails>
            <TaxDetails>
              <Imposition>WasteRecyclingFee</Imposition>
              <TaxDescription>ElectronicWasteRecyclingFee</TaxDescription>
              <TaxAmount currencyID="USD">0.0</TaxAmount>
            </TaxDetails>
          </Taxes>
          <ActualShippingCost currencyID="USD">2.0</ActualShippingCost>
          <ActualHandlingCost currencyID="USD">0.0</ActualHandlingCost>
          <OrderLineItemID>444444444444-7777777777777</OrderLineItemID>
          <ExtendedOrderID>444444444444-7777777777777!545454545454</ExtendedOrderID>
          <eBayPlusTransaction>false</eBayPlusTransaction>
        </Transaction>
      </TransactionArray>
      <BuyerUserID>johnbuyer</BuyerUserID>
      <PaidTime>2015-10-11T00:00:00.000Z</PaidTime>
      <IntegratedMerchantCreditCardEnabled>false</IntegratedMerchantCreditCardEnabled>
      <EIASToken>nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn==</EIASToken>
      <PaymentHoldStatus>PaymentHold</PaymentHoldStatus>
      <PaymentHoldDetails>
        <ExpectedReleaseDate>2015-10-31T07:00:00.000Z</ExpectedReleaseDate>
        <RequiredSellerActionArray>
          <RequiredSellerAction>MarkAsShipped</RequiredSellerAction>
        </RequiredSellerActionArray>
        <NumOfReqSellerActions>1</NumOfReqSellerActions>
        <PaymentHoldReason>NewSeller</PaymentHoldReason>
      </PaymentHoldDetails>
      <IsMultiLegShipping>false</IsMultiLegShipping>
      <SellerUserID>joeseller</SellerUserID>
      <SellerEIASToken>mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm==</SellerEIASToken>
      <CancelStatus>NotApplicable</CancelStatus>
      <ExtendedOrderID>444444444444-6666666666666!545454545454</ExtendedOrderID>
      <ContainseBayPlusTransaction>false</ContainseBayPlusTransaction>
    </Order>
  </OrderArray>
  <OrdersPerPage>100</OrdersPerPage>
  <PageNumber>1</PageNumber>
  <ReturnedOrderCountActual>2</ReturnedOrderCountActual>
</GetOrdersResponse>